#include"Enemy.h"
#include"Model.h"
#include"Master.h"
#include"Player3D.h"
#include"Object3D.h"
#include"ObjectManager.h"
//
#include"Scene3D.h"
#include"SceneManager.h"
#include"Stage.h"
#include"DrawHp.h"
#include"Coin.h"


#include"Wall.h"
#include"Scene.h"
#include"Tree.h"
#include"ColliderManager.h"
#include"SphereCollider.h"
#include"CapsuleCollider.h"


Enemy::Enemy(std::string filename, VECTOR initPos, float hp, float speed, float attack, float HitSize, float Serch1, float Serch2, float Serch3, float xp,int money, bool isSeparateAnim)
	:Object3D(initPos)
	, hp_(hp)
	, speed_(speed)
	, mbInvisible(false)
	, mfAngle(0.0f)
	, mfTargetAngle(0.0f)
	, mfSize(HitSize)
	, HitSerch(Serch1)
	, HitAttackSerch(Serch2)
	, HitStopSerch(Serch3)
	, mfHaveXp(xp)
	, AlgHit(20)
	, attack_(attack)
	, NoPosition(VGet(0, 0, 0))
	, AttackHitJudgmentflag(false)
	, isHitAttackSearch(false)
	, isHitSerchStop(false)
	, isHitAttack(false)
	, isHitSearch(false)
	, HitJudgmentflag_Player(false)
	, WalkCount(0)
	, WalkTimer(0)
	, isDead(false)
	, max_hp_(hp)
	,mfHaveMoney(money)
	//,Animation(false)
{
	SetTag(Object3D::Tag3D_Enemy3D);
	//鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽ｢鬯ｩ蟷｢ｽｽｽ｢髫ｴ謫ｾｽｽｽｴ驛｢譎｢ｽｽｽｻ郢晢ｽｻ陷ｿ髢譌ｭ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｯｽｨ繝ｻｽｾ髯溘ｻ螻ｮ繝ｻｽｽ繝ｻｽｻ鬮ｦｽｮ陷ｷｽｶ郢晢ｽｻ
	model_ = new Model(filename, initPos, isSeparateAnim);
	model_->SetScale(VGet(1.3f, 1.3f, 1.3f));
	VinitPos = initPos;
	max_hp_ = hp_;
	mfNormalSpeed = speed_;

	mpCapsuleCollider = new CapsuleCollider(this, position_, VAdd(position_, VGet(0.0f, mfSize/2, 0.0f)), mfSize);
	mpAttachCollider = new SphereCollider(this, model_->GetAttachmentPosition(), 50.0f);
	mpSerchCollider = new SphereCollider(this, position_, HitSerch);//鬯ｮｽｫ繝ｻｽｰ郢晢ｽｻ繝ｻｽｨ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｵ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｯｽｷ繝ｻｽｻ鬮｢ｽｧ繝ｻｽｲ鬩埼托ｽｻ繝ｻｽｽｽｩ陟轣假ｽｾ蜉ｱ繝ｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽ･鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｯｽｷ繝ｻｽｷ郢晢ｽｻ繝ｻｽｶ驛｢譎｢ｽｽｽｻ鬩阪ｻ謌滂ｾつ陷･謫ｾｽｽｽｹ隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
	mpAttackCollider = new SphereCollider(this, position_, HitAttackSerch);//鬯ｮｽｫ繝ｻｽｰ郢晢ｽｻ繝ｻｽｨ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｵ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｯｽｷ繝ｻｽｻ髣費ｿｽ繝ｻｽ･髫ｲｽ｢陝ｷ繝ｻ譴ｭ郢晢ｽｻ繝ｻｽｦ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ鬯ｮｽｯ隴取ｸ可繝ｻｽｶ郢晢ｽｻ繝ｻｽｹ髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ驕ｶ謫ｾｽｽｽｫ郢晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ鬮ｯｽｷ繝ｻｽｿ郢晢ｽｻ繝ｻｽ･鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
	mpStopCollider = new SphereCollider(this, position_, HitStopSerch);//鬯ｮｽｫ繝ｻｽｰ郢晢ｽｻ繝ｻｽｨ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｵ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｨ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｯｽｮ繝ｻｽｴ鬮｢ｽｧ繝ｻｽｴ鬮ｴ雜｣ｽｽｽｨ鬮ｯ讖ｸｽｽｽｻ郢晢ｽｻ繝ｻｽｬ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｯｽｷ闔会ｽ｣郢晢ｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｿ鬮ｫｽｴ隰ｫｽｾ繝ｻｽｽ繝ｻｽｴ鬮ｫｽｨ郢晢ｽｻ繝ｻｽｽ繝ｻｽｽ鬯ｮｽｯ繝ｻｽｷ繝ｻ縺､ﾂ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
	//new DrawHp("",  //鬯ｯｽｨ繝ｻｽｾ髯具ｽｹ郢晢ｽｻ繝ｻｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ鬯ｮｽｯ繝ｻｽｷ髯ｷ莉｣繝ｻ繝ｻｽｽ繝ｻｽｸ髫ｶ髮｣ｽｽｽ｣髯区ｻゑｽｽｽｹ
	//	(VAdd(position_, VGet(0.0f, 100.0f, 0.0f))),//鬯ｮｽ｣陋ｹ繝ｻｽｽｽｽ繝ｻｽｳ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｭ鬯ｮｽｯ雋翫ｑｽｽｽｽ繝ｻｽ｢鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｧ鬯ｮｽｫ繝ｻｽｶ鬮ｦｽｮ陷ｷｽｶ郢晢ｽｻ
	  // 鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｳ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｩ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ､鬯ｩ蟷｢ｽｽｽ｢髫ｴ諠ｹｽｼ螟ｲｽｽｽｽ繝ｻｽｹ髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬯ｯｽｨ繝ｻｽｾ髯溘ｻ螻ｮ繝ｻｽｽ繝ｻｽｻ鬮ｦｽｮ陷ｷｽｶ郢晢ｽｻ
	
	
}

Enemy::~Enemy()
{
	if (model_ != nullptr)
	{
		delete model_;
		model_ = nullptr;
	}
	
}

void Enemy::Update()
{
	
		
	
	
		if (model_ != nullptr)
		{
			DeathEnemy();//鬯ｮｽｫ繝ｻｽｰ郢晢ｽｻ繝ｻｽｨ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｵ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬯ｮｽｮ陋ｹｽｺ繝ｻｽｧ繝ｻｽｫ驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｮ荵昴ｻｾつ繝ｻｽｪ驛｢譎｢ｽｽｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬯ｯｽｮ繝ｻｽｦ郢晢ｽｻ繝ｻｽｪ鬩包ｽｶ闔ｨ竏ｬｽｱｽｪ郢晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｯ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｪ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｢鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｯｽｷ繝ｻｽｷ郢晢ｽｻ繝ｻｽｶ驛｢譎｢ｽｽｽｻ髴托ｽ｢隴会ｽｦ繝ｻｽｽ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ鬮ｮ荵昴ｻ遶乗ｧｭ繝ｻ繝ｻｽｽ驕ｶ謫ｾｽｽｽｫ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｫ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｳ鬯ｩ蟷｢ｽｽｽ｢髫ｴ荳ｻ繝ｻ隶捺ｺｽｽｹ譎｢ｽｽｽｻ髯橸ｽｳ陞滂ｽｲ繝ｻｽｽ繝ｻｽｲ驛｢ｽｧ郢晢ｽｻ繝ｻｽｽ繝ｻｽｸ髯ｷｽｻ繝ｻｽｻ郢晢ｽｻ繝ｻｽｽ鬮｢ｽｾ繝ｻｽ･郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
			Attack();
			CollPositionUpdate();
			RotationByMove();
			Move();
			/////鬯ｮｽｯ雋頑瑳ｽｱ螢ｹ繝ｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｾm鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｯｽｷ繝ｻｽｻ鬨ｾ雜｣ｽｽｽｯ髫ｨ繝ｻｽｽｽ｡鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ､鬯ｮｽｯ繝ｻｽｷ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｦ鬯ｯｽｨ繝ｻｽｾ驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ
		
			model_->Update();
			//mpDH->Update();//drawHp鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｢鬯ｩ蟷｢ｽｽｽ｢髫ｴ謫ｾｽｽｽｴ驛｢譎｢ｽｽｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ蟷｢ｽｽｽ｢髫ｴ謫ｾｽｽｽｴ驛｢譎｢ｽｽｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ蟷｢ｽｽｽ｢髫ｴ荳ｻ繝ｻ隶捺ｺｽｽｹ譎｢ｽｽｽｻ髯橸ｽｳ陞｢ｽｽｾ趣ｽ､驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｼ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｶ
			
		}

	
}

void Enemy::Draw()
{
	if (model_ != nullptr)
	{
		model_->Draw();
	}
	if (Master::mpDebug->Getdebug() == true && Master::mpEnemySerch->getSerch() == false)
	{
		DrawCapsule3D(position_, VAdd(position_, VGet(0.0f, 150.0f, 0.0f)),
			mfSize,
			8,
			GetColor(255, 255, 255),
			GetColor(255, 255, 255),
			false
		);
	}
	if (Master::mpEnemySerch->getSerch() == true)
	{
		DrawCapsule3D(position_, VAdd(position_, VGet(0.0f, 150.0f, 0.0f)),
			mfSize * 5,
			8,
			GetColor(255, 0, 0),
			GetColor(255, 0, 0),
			false
		);
	}
	

}

void Enemy::AttackList()
{
	

}

void Enemy::Attack()
{
	AnimationState now = model_->GetNowState();
	
	if (AttackCount >= AttackInterval&& isHitAttackSearch)
	{
		Master::mpSoundManager->PlaySE(SoundManager::SE_ATTACKSLIDE);
		AttackCount = 0;
		//鬯ｮｽｫ繝ｻｽｰ郢晢ｽｻ繝ｻｽｾ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｻ鬯ｮｽｫ繝ｻｽｰ郢晢ｽｻ繝ｻｽｦ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ郢晢ｽｻ陞ｳ莠･謫郢晢ｽｻ繝ｻｽｹ髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｷ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｧ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｳ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｫ鬯ｮｽｯ隶灘･ｽｽｽｺ繝ｻｽｽ髯具ｽｻ繝ｻｽ､鬮ｯ譎｢ｽｽｽｲ郢晢ｽｻ繝ｻｽｩ
		model_->ChangeAnimation(ANIMATION_ATTACK);
		//鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｫ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬯ｩ蟷｢ｽｽｽ｢髫ｴ諠ｹｽｸ讖ｸｽｽｽｹ繝ｻｽｲ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬯ｮｽｴ陜捺ｺｷ郢ｭ鬯ｮｽｮ繝ｻｽｷ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｪ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
		model_->SetLoop(false);
		//鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽ｢鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｷ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｧ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｳ鬯ｮｽｯ雋ｽｷ關灘ｸ吶ｻ繝ｻｽｾ髯溷供ｽｾ蠕後ｻ鬯ｮｽｯ雋ｽｯ繝ｻｽｼ隴∬後ｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｩ鬮ｮ荵昴ｻ繝ｻｽｽ繝ｻｽｩ鬨ｾｽｧ繝ｻｽｮ郢晢ｽｻ繝ｻｽｹ髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｷ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｧ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｳ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｫ鬯ｮｽｫ繝ｻｽｰ鬯ｲ繝ｻｽｼ螟ｲｽｽｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
		model_->SetLoopFinishState(ANIMATION_NEUTRAL);
		isHitAttackSearch = false;
	}
	if (!(now == ANIMATION_ATTACK))
	{
		AttackHitJudgmentflag = false;
		AttackCount++;
	}



}




void Enemy::Move()
{
	AnimationState now = model_->GetNowState();
	if (now == ANIMATION_ATTACK||now==ANIMATION_ATTACKMAGIC||now==ANIMATION_ATTACKJUMP)return;
	if (Master::SafePointOn)position_ = VinitPos;//鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬩幢ｽ｢繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｼ郢晢ｽｻ繝ｻｽｽ鬯ｩ蟷｢ｽｽｽ｢髫ｴ諠ｹｽｸ讖ｸｽｽｽｹ繝ｻｽｲ郢晢ｽｻ陷ｿ蜴ｽｽｽｨ隰夲ｽｵ繝ｻｽｽ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ､鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽ､鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｫｽｰ騾搾ｽｲ繝ｻｽｻ郢ｧ謇假ｽｽｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｮ鬮ｴ螟ｧｽ｣ｽｼ騾墓ｺｽｽｹ譎｢ｽｽｽｻ鬯ｮｽｯ隲幢ｽｶ繝ｻｽｽ繝ｻｽｨ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｰ鬯ｮｽｯ隴趣ｽ｢繝ｻｽｽ繝ｻｽｶ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｯ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｫ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ驛｢譎｢ｽｽｽｻ髴托ｽ｢隴会ｽｦ繝ｻｽｽ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｪ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｴ螟ｧｽ｣ｽｼ騾墓ｺｽｽｹ譎｢ｽｽｽｻ鬯ｮｽｫ繝ｻｽｴ髯晢ｽｶ繝ｻｽｶ郢晢ｽｻ繝ｻｽｺ髯区ｻゑｽｽｽ･驛｢譎｢ｽｽｽｻ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｹ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｫ鬯ｮｽｫ繝ｻｽｰ鬯ｲ繝ｻｽｼ螟ｲｽｽｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
	

	auto mpPlayer = Master::mpPlayer;
	Player3D* pPlayer = Master::mpPlayer;

	moveVec = VGet(0.0f, 0.0f, 0.0f);
	
	{
		if (isHitSerchStop) { speed_ = 0; } else { speed_ = mfNormalSpeed; }
		
		GoPosition = VSub(pPlayer->GetPosition(), position_);
		GoPosition.y = 0.0f; // Fix Y axis movement
		if (VSquareSize(GoPosition) > 0.0001f) GoPosition = VNorm(GoPosition);
		moveVec = GoPosition;

		bool isMove = (moveVec.x != 0.0f || moveVec.z != 0.0f);
		if (isMove) { model_->ChangeAnimation(ANIMATION_RUN); mfTargetAngle = atan2f(moveVec.x, moveVec.z); }
		else { model_->ChangeAnimation(ANIMATION_NEUTRAL); }

		VECTOR oldPosition = position_;
		position_ = VAdd(position_, VScale(moveVec, speed_));
		//////////////////////////////////////////////////////

		VECTOR hitPos = VGet(0.0f, 0.0f, 0.0f);
		//鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｹ鬯ｩ蟷｢ｽｽｽ｢髫ｴ謫ｾｽｽｽｴ驛｢譎｢ｽｽｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｸ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｨ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ雋ｽｷ郢晢ｽｻ髣憺屮ｽｽｽｭ鬮ｫｽｨ繝ｻｽｳ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ鬯ｯｽｮ繝ｻｽｮ驕ｶ謫ｾｽｽｽｵ驛｢譎｢ｽｽｽｻ鬯ｮｽｯ隶厄ｽｸ繝ｻｽｽ繝ｻｽｳ鬮ｯ讖ｸｽｽｽ｢郢晢ｽｻ繝ｻｽｹ驛｢譎｢ｽｽｽｻ髯懶ｽ｣繝ｻｽ､郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ鬮ｯｽｷ繝ｻｽｷ郢晢ｽｻ繝ｻｽｶ驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ
		hitPos = VGet(0.0f, 0.0f, 0.0f);
		bool isHit = false;
		// 蝨ｰ蠖｢ｼ医せ繝繝ｼ繧ｸｼ峨↓豐ｿ縺蜃ｦ逅
		TerrainFollow(0.0f, 150.0f, 40.0f, 150.0f, -40.0f, 4.0f);
		const auto& walls = Master::mpSceneManager->GetCurrentScene()->GetObjectManager()->GetObject3DListByTag(Object3D::Tag3D_Wall3D);
		if (!walls.empty())
		{
			// 鬯ｮｽｯ雋ｽｷ郢晢ｽｻ髣憺屮ｽｽｽｭ鬮ｫｽｨ繝ｻｽｳ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｣鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ驛｢譎｢ｽｽｽｻ鬩阪ｻ謌溘ｻｽ､繝ｻｽｶ鬩包ｽｶ闕ｳ讖ｸｽｽｽ､繝ｻｽｲ郢晢ｽｻ繝ｻｽｽ髯晢ｽｶ隴惹ｹ怜･鈴Δ譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｿ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｹ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
			// hint: 鬯ｮｽｴ隰蛛ｽｽｽｽ繝ｻｽｴ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｾ鬯ｮｽｴ隰蛛ｽｽｽｽ繝ｻｽ･驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｶ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ繝ｻｽｷ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｦ鬯ｯｽｨ繝ｻｽｾ驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ鬩搾ｽｵ繝ｻｽｲ髯懶ｽ｣繝ｻｽ､郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｯ1鬯ｮｽｫ繝ｻｽｴ郢晢ｽｻ繝ｻｽｫ鬮ｯ讖ｸｽｽｽ｢郢晢ｽｻ繝ｻｽｹ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｮｽｯ隶厄ｽｸ繝ｻｽｽ繝ｻｽ｢鬩包ｽｶ闕ｳ讖ｸｽｽｽ､繝ｻｽｲ郢晢ｽｻ繝ｻｽｼ郢晢ｽｻ繝ｻｽｽ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｯ蜈ｷｽｽｽｹ郢晢ｽｻ繝ｻｽｺ鬮ｫｽｲ繝ｻｽ､髯ｷｽ･陟托ｽｱ隨卍鬩幢ｽ｢繝ｻｽｧ髴大｣ｼ陌ｫ繝ｻｽ｣繝ｻｽｭ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｫ鬯ｮｽｯ陷茨ｽｷ繝ｻｽｽ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ､鬯ｮｽｯ隶厄ｽｸ繝ｻｽｽ繝ｻｽｳ鬮ｯ讖ｸｽｽｽ｢郢晢ｽｻ繝ｻｽｹ驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ鬮ｯ貅ｷ萓帙ｻｽｨ繝ｻｽｯ驛｢譎｢ｽｽｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｧ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｲ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｮｽｫ繝ｻｽｴ郢晢ｽｻ繝ｻｽｫ鬮ｯ讓奇ｽｻ繧托ｽｽｽｽ繝ｻｽｲ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｼ鬮｣雋ｻｽ｣ｽｰ髯具ｽｹ郢晢ｽｻ繝ｻｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ･鬯ｮｽ｣陋ｹ繝ｻｽｽｽｽ繝ｻｽｳ鬮ｯ讒ｭｽ郢晢ｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬮ｯ譎｢ｽｽｽｲ郢晢ｽｻ繝ｻｽｨ鬩包ｽｶ鬯謇假ｽｽｽ･繝ｻｽ｢郢晢ｽｻ繝ｻｽｽ髯ｷﾂ繝ｻｽｶ髣憺屮ｽｽｽｭ鬮ｫｽｨ繝ｻｽｳ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｣鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬮ｫｽｨ繝ｻｽｳ驛｢譎｢ｽｽｽｻ髫ｰｽｦ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｴ鬯ｮｽｯ繝ｻｽｷ郢晢ｽｻ繝ｻｽｷ鬮ｯ蜈ｷｽｽｽｹ郢晢ｽｻ繝ｻｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｮｽｯ繝ｻｽｷ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｦ鬯ｯｽｨ繝ｻｽｾ驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ髯晢ｽｶ隴寂悪ｽｮ遘佩碑ｭ趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬩包ｽｶ隰ｫｽｾ繝ｻｽｽ繝ｻｽｴ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
			for (int i = 0; i < walls.size(); i++)
			{
				Wall* wall = walls.at(i)->CastTo<Wall>();
				if (wall != nullptr)
				{
					std::vector<VERTEX3D> vertex = wall->GetVertex();

					// 鬯ｩ蟷｢ｽｽｽ｢髫ｴ諠ｹｽｸ讖ｸｽｽｽｹ繝ｻｽｲ郢晢ｽｻ陷ｿ蜴ｽｽｽｨ隰夲ｽｵ繝ｻｽｽ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ､鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽ､鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬯ｮｽｮ陋ｹｽｺ繝ｻｽｨ陞ゅｻｽｽｽｽ繝ｻｽ｡驕ｶ謫ｾｽｽｽｫ郢晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｯ蜈ｷｽｽｽｹ郢晢ｽｻ繝ｻｽｻ鬩包ｽｶ陋ｹ繝ｻｽｽｽｽ繝ｻｽｧ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｪ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｫ鬯ｩ蟷｢ｽｽｽ｢髫ｴ諠ｹｽｸ讖ｸｽｽｽｹ繝ｻｽｲ鬩搾ｽｵ繝ｻｽｺ髫ｴ諠ｹｽｼ螟ｲｽｽｽｽ繝ｻｽｹ髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｫ鬯ｮｽｯ隲幢ｽｷ陝玖侭繝ｻ繝ｻｽｹ髫ｴ謫ｾｽｽｽｴ驛｢譎｢ｽｽｽｻ鬯ｮｽｯ陷茨ｽｷ繝ｻｽｽ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ､鬯ｮｽｯ隶厄ｽｸ繝ｻｽｽ繝ｻｽｳ鬮ｯ讖ｸｽｽｽ｢郢晢ｽｻ繝ｻｽｹ鬩包ｽｶ鬮ｮ繝ｻｽ｣ｽｰ繝ｻｽ､郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｲ鬩包ｽｶ闕ｵ諤懈ｬｾ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽ｣鬩包ｽｶ闕ｳ讖ｸｽｽｽ｣繝ｻｽｹ驛｢譎｢ｽｽｽｻ鬯ｮｽ｣陋ｹ繝ｻｽｽｽｽ繝ｻｽｳ鬯ｮｽ｣郢晢ｽｻ繝ｻｽｽ繝ｻｽｽ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｧ鬯ｮｽｮ陋ｹｽｺ繝ｻｽｩ繝ｻｽｸ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｽ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｢鬯ｩ蟷｢ｽｽｽ｢髫ｴ蠑ｱ繝ｻ繝ｻｽｺ繝ｻｽ｢郢晢ｽｻ陷ｿ謔ｶ貂夂ｹ晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｴ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｳ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｨ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ雋ｽｷ郢晢ｽｻ髣憺屮ｽｽｽｭ鬮ｫｽｨ繝ｻｽｳ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ鬯ｯｽｮ繝ｻｽｮ驕ｶ謫ｾｽｽｽｵ驛｢譎｢ｽｽｽｻ鬯ｮｽｯ隶厄ｽｸ繝ｻｽｽ繝ｻｽｳ鬮ｯ讖ｸｽｽｽ｢郢晢ｽｻ繝ｻｽｹ驛｢譎｢ｽｽｽｻ髯晢ｽｶ隴主臆ｽｷ譎櫁ｾｧ陷肴ｻゑｽｽｽｨ繝ｻｽｯ鬯ｲ蛛ｽｽｽｬ
					if (HitCheck_Capsule_Triangle(
						position_,
						VAdd(position_, VGet(0.0f, 200.0f, 0.0f)),
						80.0f,
						vertex.at(0).pos, vertex.at(1).pos, vertex.at(2).pos) ||
						HitCheck_Capsule_Triangle(
							position_,
							VAdd(position_, VGet(0.0f, 200.0f, 0.0f)),
							80.0f,
							vertex.at(3).pos, vertex.at(1).pos, vertex.at(2).pos)
						)
					{



						// 鬯ｮｽｯ隶厄ｽｸ繝ｻｽｽ繝ｻｽ｢鬩包ｽｶ闕ｳ讖ｸｽｽｽ｣繝ｻｽｺ驛｢譎｢ｽｽｽｻ鬯ｮｽｮ陷ｿ蜀ｶ繝ｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｿ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｣鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｯｽｮ繝ｻｽｯ郢晢ｽｻ繝ｻｽｦ鬮ｯ貊灘擠繝ｻｽｯ闔ｨ螟ｲｽｽｽｽ繝ｻｽｿ郢晢ｽｻ繝ｻｽ･鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｯ蜈ｷｽｽｽｹ郢晢ｽｻ繝ｻｽｻ鬩包ｽｶ陋ｹ繝ｻｽｽｽｽ繝ｻｽｧ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｪ鬯ｩ蟷｢ｽｽｽ｢髫ｴ荳ｻ繝ｻ陷ｽｽ鬩搾ｽｵ繝ｻｽｺ鬯ｩｽ｢隰ｳｽｾ繝ｻｽｽ繝ｻｽｹ髫ｴ荳ｻ繝ｻ隶捺ｺ倥ｻ陷ｿ髢譌ｭ郢晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ鬯ｮｽｮ陋ｹｽｺ繝ｻｽｧ繝ｻｽｫ髯溷供ｽｮｽ｣髴趣ｽｧ鬮ｴ蝓滄ｱ堤ｹ晢ｽｻ
						VECTOR slide = VGet(0.0f, 0.0f, 0.0f);  // 鬯ｮｽｯ隶厄ｽｸ繝ｻｽｽ繝ｻｽ｢鬩包ｽｶ隰ｫｽｾ繝ｻｽｽ繝ｻｽｵ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｲ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｿ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｯ鬯ｩ蟷｢ｽｽｽ｢髫ｴ荳ｻ繝ｻ隶捺ｺ倥ｻ陟托ｽｱ郢晢ｽｻ
						float a = VDot(VScale(moveVec, -1.0f), vertex.at(0).norm);  // 鬯ｯｽｩ陷肴ｺｪ繝ｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ鬯ｮｽｯ繝ｻｽｷ髫ｶ荳ｻｽ･繝ｻｽｽｽｽ繝ｻｽ｢髴難ｽ｣陋帙ｻｽｽｽｽ繝ｻｽｩ郢晢ｽｻ繝ｻｽｿ鬯ｮｽｯ繝ｻｽｷ郢晢ｽｻ繝ｻｽｷ鬮｣豈費ｽｼ螟ｲｽｽｽｽ繝ｻｽ｣鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｯ鬯ｩ蟷｢ｽｽｽ｢髫ｴ荳ｻ繝ｻ隶捺ｺ倥ｻ陷ｿ髢譌ｭ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ繝ｻｽｷ郢晢ｽｻ繝ｻｽｿ鬮ｫｽｶ闕ｳｽｻ繝ｻｽ･郢晢ｽｻ繝ｻｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｯ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｾ鬯ｩ蟷｢ｽｽｽ｢髫ｴ荳ｻ繝ｻ陷ｽｽ鬩搾ｽｵ繝ｻｽｺ鬯ｩｽ｢隰ｳｽｾ繝ｻｽｽ繝ｻｽｹ髫ｴ荳ｻ繝ｻ隶捺ｺ倥ｻ陷ｿ髢譌ｭ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｨ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｲ鬩包ｽｶ闕ｵ諤懈ｬｾ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽ｣鬩包ｽｶ闕ｳ讖ｸｽｽｽ｣繝ｻｽｹ驛｢譎｢ｽｽｽｻ鬯ｮｽｮ闕ｳｽｻ繝ｻｽ｢髦ｮ蜷ｶ繝ｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｷ鬮ｯ讖ｸｽｽｽ｢郢晢ｽｻ繝ｻｽｹ鬩包ｽｶ鬮ｮ繝ｻｽ｣ｽｰ繝ｻｽ､郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ繝ｻｽｷ繝ｻ縺､ﾂ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｩ鬯ｯｽｮ繝ｻｽｦ郢晢ｽｻ繝ｻｽｪ驛｢譎｢ｽｽｽｻ髯橸ｽｳ陞滂ｽｲ繝ｻｽｽ繝ｻｽｱ髯滓汚ｽｽｽｱ郢晢ｽｻ郢晢ｽｻ郢晢ｽｻ驕ｶ謫ｾｽｽｽｫ郢晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
						slide = VAdd(moveVec, VScale(vertex.at(0).norm, a));    // 鬯ｮｽｯ隶厄ｽｸ繝ｻｽｽ繝ｻｽ｢鬩包ｽｶ隰ｫｽｾ繝ｻｽｽ繝ｻｽｵ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｲ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｿ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｯ鬯ｩ蟷｢ｽｽｽ｢髫ｴ荳ｻ繝ｻ隶捺ｺ倥ｻ陷ｿ髢譌ｭ郢晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ鬮ｯ讖ｸｽｽｽｳ髯樊ｻゑｽｽｽｲ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｨ鬯ｮｽ｢繝ｻｽｧ郢晢ｽｻ繝ｻｽｲ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ

						// 鬯ｮｽ｣陋ｹ繝ｻｽｽｽｽ繝ｻｽｳ鬯ｮｽｫ繝ｻｽｴ鬯ｲ繝ｻｽｼ螟ｲｽｽｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｦ鬯ｮｽｯ雋ｽｯ繝ｻｽｶ繝ｻｽ｣郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｧ鬯ｮｽｫ繝ｻｽｶ髴難ｽ｣陋滂ｽ｡陷ｽｽ驛｢譎｢ｽｽｽｻ髯橸ｽｳ陞滂ｽｲ繝ｻｽｽ繝ｻｽｬ鬯ｲ繝ｻｽｼ螟ｲｽｽｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｯｽｷ闔ｨ螟ｲｽｽｽｽ繝ｻｽｱ鬩包ｽｯ繝ｻｽｶ郢晢ｽｻ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮｣蛹ｽｽｽｵ髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ鬮｣繝ｻｽｽｽｽ髫ｶﾂ繝ｻｽｶ鬩包ｽｶ闕ｳ讖ｸｽｽｽ｣繝ｻｽｺ驛｢譎｢ｽｽｽｻ鬯ｮｽｮ陷ｿ蜀ｶ繝ｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｿ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｣鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｮｽｮ陟托ｽｱ郢晢ｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｩ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮｣蛹ｽｽｽｳ髯槭ｅ繝ｻ繝ｻｽｽ繝ｻｽｽ鬮｢ｽｧ繝ｻｽｲ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬩包ｽｶ闔ｨ竏ｬｽｱｽｪ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ鬮ｯｽｷ繝ｻｽｷ郢晢ｽｻ繝ｻｽｶ驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ
						position_ = oldPosition;
						position_ = VAdd(position_, VScale(slide, speed_));
					}
				}
			}
		}




		model_->SetPosition(position_);


	}
}

void Enemy::RotationByMove()
{
	//鬯ｮｽｴ隰蛛ｽｽｽｽ繝ｻｽｴ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｾ鬯ｮｽｯ隲幢ｽｶ繝ｻｽｽ繝ｻｽｨ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｨ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ隲帙ｻｽｻｽｸ郢晢ｽｻ繝ｻｽｫ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｢鬯ｮｽｯ陋ｹｽｺ繝ｻｽｻ郢ｧ謇假ｽｽｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽ､鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮｣蛹ｽｽｽｵ髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ鬮ｯ蜈ｷｽｽｽｾ繝ｻ縺､ﾂ郢晢ｽｻ繝ｻｽｶ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｫ繝ｻｽｶ髴難ｽ｣陋滂ｽ｡陷ｽｽ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｮｽｯ隲帙ｻｽｻｽｸ郢晢ｽｻ繝ｻｽｫ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｢鬯ｮｽｯ陋ｹｽｺ繝ｻｽｻ郢ｧ謇假ｽｽｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽ､鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ隴趣ｽ｢繝ｻｽｽ繝ｻｽｾ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ陷茨ｽｷ繝ｻｽｽ繝ｻｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ驛｢譎｢ｽｽｽｻ髯橸ｽｳ陞滂ｽｲ繝ｻｽｽ繝ｻｽｱ髯滓汚ｽｽｽｱ郢晢ｽｻ郢晢ｽｻ郢晢ｽｻ驕ｶ謫ｾｽｽｽｫ郢晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
	float subAngle = mfTargetAngle - mfAngle;

	//鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ鬩阪ｻ遘√ｻｽｽ繝ｻｽｭ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｹ鬯ｮｽｯ繝ｻｽｷ郢晢ｽｻ繝ｻｽｷ鬮｣豈費ｽｼ螟ｲｽｽｽｽ繝ｻｽ｣郢晢ｽｻ郢ｧ謇假ｽｽｽｽ繝ｻｽｰ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｯ譎｢ｽｽｽｲ郢晢ｽｻ繝ｻｽｨ鬩包ｽｶ陋ｹ繝ｻｽｽｽｿ繝ｻｽｽ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｯ蜈ｷｽｽｽｹ郢晢ｽｻ繝ｻｽｺ鬮ｯ謨鳴郢晢ｽｻ繝ｻｽｿ鬯ｮｽｯ繝ｻｽｷ郢晢ｽｻ繝ｻｽｷ鬮｣豈費ｽｼ螟ｲｽｽｽｽ繝ｻｽ｣鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｮｽｯ隴趣ｽ｢繝ｻｽｽ繝ｻｽｾ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬯ｯｽｲ郢晢ｽｻ繝ｻｽｼ陞滂ｽｲ繝ｻｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬮ｫｽｰ郢晢ｽｻ遶乗ｧｭ繝ｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬮ｯ蜿･ｽｸ蜷ｶ繝ｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬮｣逧ｮ逕･鬩墓翫ｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｮｽ｣雎郁ｲｻｽｽｽｼ陞滂ｽｲ繝ｻｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽ･鬯ｮｽ｣陋ｹ繝ｻｽｽｽｽ繝ｻｽｳ鬮ｯ讒ｭｽ郢晢ｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬮｣雋ｻｽ｣ｽｰ髯具ｽｹ郢晢ｽｻ繝ｻｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ･鬯ｮｽ｣陋ｹ繝ｻｽｽｽｽ繝ｻｽｳ鬮ｯｽｷ髣鯉ｽｨ繝ｻｽｽ繝ｻｽｷ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｼ鬮ｯ譎｢ｽｽｽｲ郢晢ｽｻ繝ｻｽｨ鬩包ｽｶ闔ｨ竏ｬｽｱｽｪ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｪ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮｣蛹ｽｽｽｵ髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｼ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｨ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｯ貅ｷ萓帙ｻｽｨ繝ｻｽｯ驛｢譎｢ｽｽｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｯ讖ｸｽｽｽ｢郢晢ｽｻ繝ｻｽｹ鬩包ｽｶ闔ｨ竏壹ｻ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｧ
	//鬯ｮｽｯ隴趣ｽ｢繝ｻｽｽ繝ｻｽｾ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ陋ｹｽｺ繝ｻｽｻ郢ｧ謇假ｽｽｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽ､鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬯ｯｽｲ郢晢ｽｻ繝ｻｽｼ陞滂ｽｲ繝ｻｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬮ｫｽｰ郢晢ｽｻ遶乗ｧｭ繝ｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬮ｯ蜿･ｽｸ蜷ｶ繝ｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬯ｮｽｯ隲帑ｼ夲ｽｽｽｼ陞滂ｽｲ繝ｻｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ･鬯ｮｽ｣陋ｹ繝ｻｽｽｽｽ繝ｻｽｳ鬮ｯ讒ｭｽ郢晢ｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬮｣雋ｻｽ｣ｽｰ髯具ｽｹ郢晢ｽｻ繝ｻｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ･鬯ｮｽ｣陋ｹ繝ｻｽｽｽｽ繝ｻｽｳ鬮ｯｽｷ髣鯉ｽｨ繝ｻｽｽ繝ｻｽｷ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｼ鬮ｯ譎｢ｽｽｽｲ郢晢ｽｻ繝ｻｽｨ鬩包ｽｶ闔ｨ竏ｬｽｱｽｪ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｪ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｣鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬮ｫｽｨ繝ｻｽｳ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｹ郢晢ｽｻ繝ｻｽｧ鬯ｮｽ｢繝ｻｽｾ郢晢ｽｻ繝ｻｽ･鬮ｮ雜｣ｽｽｽｬ郢晢ｽｻ繝ｻｽ｣鬯ｮｽｮ陟托ｽｱ郢晢ｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽ｣鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｯｽｷ繝ｻｽｷ郢晢ｽｻ繝ｻｽｶ驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ
	if (subAngle < -DX_PI_F)
	{
		subAngle += DX_TWO_PI_F;
	}
	if (subAngle > DX_PI_F)
	{
		subAngle -= DX_TWO_PI_F;
	}

	//鬯ｯｽｮ繝ｻｽｫ鬮｣蝓ｼ螻ｮ繝ｻｽｽ繝ｻｽｲ髫ｶ蜴ｽｽｽｸ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ隴趣ｽ｢繝ｻｽｽ繝ｻｽｾ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ陷茨ｽｷ繝ｻｽｽ繝ｻｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ驛｢譎｢ｽｽｽｻ髯橸ｽｳ陞滂ｽｲ繝ｻｽｿ繝ｻｽｽ髫ｰ讙趣ｽｿｽｫ郢晢ｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬩包ｽｶ鬯伜ｽｾｽｭ驛｢譎｢ｽｽｽｻ鬯ｮｽ｣鬮ｮ繝ｻｽｽｽｨ繝ｻｽｯ驛｢譎｢ｽｽｽｻ鬯ｯｽｮ繝ｻｽｴ髯ｷｽｿ繝ｻｽｰ郢晢ｽｻ繝ｻｽｻ郢晢ｽｻ繝ｻｽ｣鬮ｫｽｨ郢晢ｽｻ繝ｻｽｽ繝ｻｽｼ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮｣豈費ｽｼ螟ｲｽｽｽｽ繝ｻｽ｣驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ
	if (subAngle > 0.0f)
	{
		subAngle -= ROTATE_SPEED;
		if (subAngle < 0.0f)
		{
			subAngle = 0.0f;
		}
	}
	else if (subAngle < 0.0f)
	{
		subAngle += ROTATE_SPEED;
		if (subAngle > 0.0f)
		{
			subAngle = 0.0f;
		}
	}
	//鬯ｮｽ｣驕貞､ｧｽｴ貅ｯ讌懊ｻｽｦ鬯ｯｽｯ繝ｻｽｮ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬩包ｽｯ繝ｻｽｶ郢晢ｽｻ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｯｽｷ闔ｨ螟ｲｽｽｽｽ繝ｻｽｱ驛｢譎｢ｽｽｽｻ髫ｶ髮｣ｽｽｽ｣髯憺斡ｽｦｽｴ陝讚ｽｮ蜴ｽｽｽｸ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｯ諛ｶｽｽｽ｣郢晢ｽｻ繝ｻｽ､鬯ｮｽ｢繝ｻｽｧ驛｢譎｢ｽｽｽｻ髫ｲｽ､陟托ｽｱ郢晢ｽｻ郢晢ｽｻ繝ｻｽｺ
	mfAngle = mfTargetAngle - subAngle;

	//鬯ｮｽｯ隲帙ｻｽｻｽｸ郢晢ｽｻ繝ｻｽｫ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｢鬯ｮｽｯ陋ｹｽｺ繝ｻｽｻ郢ｧ謇假ｽｽｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽ､鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｯ讖ｸｽｽｽｳ髯樊ｻゑｽｽｽｲ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｨ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｭ鬯ｮｽｯ隶厄ｽｸ繝ｻｽｽ繝ｻｽｳ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
	rotation_.y = mfAngle + DX_PI_F;
	//鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽ｢鬯ｩ蟷｢ｽｽｽ｢髫ｴ謫ｾｽｽｽｴ驛｢譎｢ｽｽｽｻ郢晢ｽｻ陷ｿ髢譌ｭ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｫ鬯ｮｽ｣髮具ｽｻ繝ｻｽｽ繝ｻｽｨ鬮ｫｽｴ隰ｫｽｾ繝ｻｽｽ繝ｻｽｴ鬩包ｽｶ隰ｫｽｾ繝ｻｽｽ繝ｻｽｴ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
	model_->SetRotation(rotation_);


}

void Enemy::Damage(float damage)
{

	hp_ -= damage;
	if(hp_ <= 0)
	{
		hp_ = 0;
		isDead = true;
	}
}



void Enemy::DeathEnemy()
{
	if (!isDead)return;
	
	model_->ChangeAnimation(ANIMATION_DYING);
	//鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｫ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬯ｩ蟷｢ｽｽｽ｢髫ｴ諠ｹｽｸ讖ｸｽｽｽｹ繝ｻｽｲ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬯ｮｽｴ陜捺ｺｷ郢ｭ鬯ｮｽｮ繝ｻｽｷ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｪ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
	model_->SetLoop(false);
	//鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽ｢鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｷ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｧ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｳ鬯ｮｽｯ雋ｽｷ關灘ｸ吶ｻ繝ｻｽｾ髯溷供ｽｾ蠕後ｻ鬯ｮｽｯ雋ｽｯ繝ｻｽｼ隴∬後ｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｩ鬮ｮ荵昴ｻ繝ｻｽｽ繝ｻｽｩ鬨ｾｽｧ繝ｻｽｮ郢晢ｽｻ繝ｻｽｹ髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｷ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｧ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｳ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｫ鬯ｮｽｫ繝ｻｽｰ鬯ｲ繝ｻｽｼ螟ｲｽｽｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
	//鬯ｩ蟷｢ｽｽｽ｢髫ｴ謫ｾｽｽｽｴ驛｢譎｢ｽｽｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ蟷｢ｽｽｽ｢髫ｴ謫ｾｽｽｽｴ驛｢譎｢ｽｽｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｼ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｧ鬯ｩ蟷｢ｽｽｽ｢髫ｴ謫ｾｽｽｽｴ驛｢譎｢ｽｽｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｮｽｯ雋ｽｯ繝ｻｽｼ隴∬後ｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｮｽｯ雋ｽｯ繝ｻｽｼ隴∬後ｻ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｩ鬮ｮ荵昴ｻ繝ｻｽｽ繝ｻｽｩ鬨ｾｽｧ繝ｻｽｮ郢晢ｽｻ繝ｻｽｹ髫ｴ謫ｾｽｽｽｴ驛｢譎｢ｽｽｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｼ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｧ鬯ｩ蟷｢ｽｽｽ｢髫ｴ謫ｾｽｽｽｴ驛｢譎｢ｽｽｽｻ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｫ鬯ｮｽｫ繝ｻｽｰ鬯ｲ繝ｻｽｼ螟ｲｽｽｽｽ繝ｻｽｽ郢晢ｽｻ繝ｻｽｻ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
	model_->SetLoopFinishState(ANIMATION_MAX);
	
	Delete();
	if (model_->IsAnimationLoopFinish())
	{
		GiveRewards();
		if (Master::TutorialFlag) { Master::TutorialCount++; }
		
		
		SetDeleteFlag(true);
	}
	
	model_->Update();
	
	
}

void Enemy::DeathColliderPosition()
{
	VECTOR pos = VGet(10000, 10000, 10000);
	if (mpCapsuleCollider != nullptr)
	{
		mpCapsuleCollider->position_ = pos;
		mpCapsuleCollider->position2_ = pos;
	}
	if (mpAttachCollider != nullptr)
	{
		mpAttachCollider->position_ = pos;
	}
	if (mpSerchCollider != nullptr)
	{
		mpSerchCollider->position_ = pos;
	}
	if (mpStopCollider != nullptr)
	{
		mpStopCollider->SetDeleteFlag(true);
		mpStopCollider->position_ = pos;
	}
	if (mpAttackCollider != nullptr)
	{
		mpAttackCollider->position_ = pos;
	}

}

void Enemy::OnEnter(Collider* collider, Collider* check)//鬯ｮｽｯ隴趣ｽ｢繝ｻｽｽ繝ｻｽｾ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｮｽｯ陷ｿｽ･繝ｻｽｹ繝ｻｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｴ.
{
	auto mpPlayer = Master::mpPlayer;
	if (hp_ <= 0)return;
	if (collider == mpCapsuleCollider && check->parent_object_->GetTag() == Tag3D_Obj)
	{
		
		position_ = VinitPos;
	}
	
	if (check->parent_object_->GetTag() == Tag3D_Player3D)
	{
		Player3D* player = Master::mpPlayer;
		if (player == nullptr)return;
	
		if (collider == mpSerchCollider &&player->GetCollisionCollider()==check)
		{
			isHitSearch = true;
		}
		if (collider == mpAttackCollider && player->GetCollisionCollider() == check)
		{
			isHitAttackSearch = true;//鬯ｮｽｫ繝ｻｽｰ郢晢ｽｻ繝ｻｽｾ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｻ鬯ｮｽｫ繝ｻｽｰ郢晢ｽｻ繝ｻｽｦ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬮ｯ譎｢ｽｽｽｷ髫ｰ遒ｿｽ謇假ｽｽｽｲ郢ｧ髮ｽｵｽｯ髫ｴ謫ｾｽｽｽｴ繝ｻ雜｣ｽｽｽｨ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｩ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｰ

		}
		if (collider == mpStopCollider && player->GetCollisionCollider() == check)
		{
			isHitSerchStop = true;
		}
	}
	//鬯ｮｽｯ雋ｽｷ郢晢ｽｻ髣憺屮ｽｽｽｭ鬮ｫｽｨ繝ｻｽｳ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｣鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ驛｢譎｢ｽｽｽｻ鬩墓得ｽｽｽｩ郢晢ｽｻ繝ｻｽｫ郢晢ｽｻ繝ｻｽ｢鬮ｫｽｰ隰ｦｽｰ繝ｻｽｽ繝ｻｽｺ鬮ｯｽｷ郢晢ｽｻ繝ｻｽｽ繝ｻｽｾ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｮｽｯ繝ｻｽｷ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｦ鬯ｯｽｨ繝ｻｽｾ驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ
}

void Enemy::OnTrigger(Collider* collider, Collider* check)
{//鬯ｮｽｯ雋ｽｷ郢晢ｽｻ髣憺屮ｽｽｽｭ鬮ｫｽｨ繝ｻｽｳ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｣鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｮ荵昴ｻ繝ｻｽｽ繝ｻｽｽ鬮ｫｽｶｾつ郢晢ｽｻ繝ｻｽｪ鬯ｯｽｯ繝ｻｽｮ郢晢ｽｻ繝ｻｽ｢鬯ｮｽｦ繝ｻｽｮ髯ｷｽｷ繝ｻｽｶ驛｢譎｢ｽｽｽｻ鬯ｮｽｯ繝ｻｽｷ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｦ鬯ｯｽｨ繝ｻｽｾ驛｢譎｢ｽｽｽｻ驛｢譎｢ｽｽｽｻ
	if (hp_ <= 0)return; auto mpPlayer = Master::mpPlayer;
	AnimationState now = model_->GetNowState();
	if (collider == mpAttachCollider && check->parent_object_->GetTag() == Tag3D_Player3D)
	{//mpModel鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｮ鬯ｯｽｨ繝ｻｽｾ郢晢ｽｻ繝ｻｽ｡驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｪ鬯ｮｽｯ繝ｻｽｷ郢晢ｽｻ繝ｻｽｿ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｷ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬩幢ｽ｢繝ｻｽｧ驛｢譎｢ｽｽｽｻ髫ｴ魃会ｽｽｽｺ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｣鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｦ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ驛｢譎｢ｽｽｽｻ髴托ｽ｢隴会ｽｦ繝ｻｽｽ繝ｻｽｸ郢晢ｽｻ繝ｻｽｲ鬩包ｽｶ闕ｳ讖ｸｽｽｽ､郢ｧ謇假ｽｽｽｽ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｩ鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬯ｮｽｦ繝ｻｽｮ髯ｷｽｷ繝ｻｽｶ驛｢譎｢ｽｽｽｻif鬯ｮｽｫ繝ｻｽｴ驕ｶ荳橸ｽ｣ｽｹ郢晢ｽｻ鬩包ｽｶ鬯謇假ｽｽｽ･繝ｻｽ｢髫ｲｽ､繝ｻｽｦ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ･鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ鬮ｯ譎｢ｽｽｽｲ郢晢ｽｻ繝ｻｽｨ鬩包ｽｶ闔ｨ竏壹ｻ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ
		Player3D* player = Master::mpPlayer;
		if (player == nullptr)return;
		if (check == player->GetCollisionCollider())
		{
			if (now == ANIMATION_ATTACK && !AttackHitJudgmentflag)
			{

				player->Damage(attack_);
				AttackHitJudgmentflag = true;//鬯ｮｽｯ雋ｽｷ郢晢ｽｻ髣憺屮ｽｽｽｭ鬮ｫｽｨ繝ｻｽｳ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｸ郢晢ｽｻ繝ｻｽｺ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽ｣鬯ｩ謳ｾｽｽｽｵ郢晢ｽｻ繝ｻｽｺ鬮ｮ荵昴ｻ遶乗ｧｭ繝ｻ繝ｻｽｽ鬮｢ｽｧ繝ｻｽｲ郢晢ｽｻ繝ｻｽｹ髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｼ
			}
		}
	}
	
}

void Enemy::OnExit(Collider* collider, Collider* check)
{
	if (hp_ <= 0)return; auto mpPlayer = Master::mpPlayer;
	AnimationState now = model_->GetNowState();
	if (check->parent_object_->GetTag() == Tag3D_Player3D)
	{
		
		Player3D* player = Master::mpPlayer;
		if (player == nullptr)return;
		if (collider == mpAttachCollider && player->GetCollisionCollider() == check)
			{

			}
			if (collider == mpSerchCollider && player->GetCollisionCollider() == check)
			{
				isHitSearch = false;
			}
			if (collider == mpAttackCollider && player->GetCollisionCollider() == check)
			{
				isHitAttackSearch = false;//鬯ｮｽｫ繝ｻｽｰ郢晢ｽｻ繝ｻｽｾ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｻ鬯ｮｽｫ繝ｻｽｰ郢晢ｽｻ繝ｻｽｦ鬩幢ｽ｢隴趣ｽ｢繝ｻｽｽ繝ｻｽｻ鬮ｯ譎｢ｽｽｽｷ髫ｰ遒ｿｽ謇假ｽｽｽｲ郢ｧ髮ｽｵｽｯ髫ｴ謫ｾｽｽｽｴ繝ｻ雜｣ｽｽｽｨ鬯ｩ蟷｢ｽｽｽ｢髫ｴ雜｣ｽｽｽ｢郢晢ｽｻ繝ｻｽｽ郢晢ｽｻ繝ｻｽｩ鬯ｩ蟷｢ｽｽｽ｢郢晢ｽｻ繝ｻｽｧ驛｢譎｢ｽｽｽｻ郢晢ｽｻ繝ｻｽｰ

			}
			if (collider == mpStopCollider && player->GetCollisionCollider() == check)
			{
				isHitSerchStop = false;
			}
		
	}
}

void Enemy::CollPositionUpdate()
{
	if (mpCapsuleCollider != nullptr)
	{
		mpCapsuleCollider->position_ = position_;
		mpCapsuleCollider->position2_ = VAdd(position_, VGet(0.0f, 150.0f, 0.0f));
		
	}
	if (mpAttachCollider != nullptr)
	{
		mpAttachCollider->position_ = model_->GetAttachmentPosition();
	}
	if (mpSerchCollider != nullptr)
	{
		mpSerchCollider->position_ = position_;
	}
	if (mpStopCollider != nullptr)
	{
		mpStopCollider->position_ = VAdd(position_, VGet(0.0f, mfSize / 2, 0.0f));
	}
	if (mpAttackCollider != nullptr)
	{
		mpAttackCollider->position_ = VAdd(position_, VGet(0.0f, mfSize / 2, 0.0f));
	}
	
	


	
	
}

void Enemy::Delete()
{
	
	if (mpCapsuleCollider != nullptr)
	{
		mpCapsuleCollider->SetDeleteFlag(true);
		mpCapsuleCollider = nullptr;
	}
	if (mpAttachCollider != nullptr)
	{
		mpAttachCollider->SetDeleteFlag(true);
		mpAttachCollider = nullptr;
	}
	if (mpSerchCollider != nullptr)
	{
		mpSerchCollider->SetDeleteFlag(true);
		mpSerchCollider = nullptr;
	}
	if (mpStopCollider != nullptr)
	{
		mpStopCollider->SetDeleteFlag(true);
		mpStopCollider = nullptr;
	}
	if (mpAttackCollider != nullptr)
	{
		mpAttackCollider->SetDeleteFlag(true);
		mpAttackCollider = nullptr;
	}
	
}


void Enemy::GiveRewards()
{
	auto mpPlayer = Master::mpPlayer;
	Player3D* player = Master::mpPlayer;
	if (player != nullptr) {
		player->mpHaveMoney->AddMoney(mfHaveMoney);
		player->mpLevelUp->AddXp(mfHaveXp);
	}
}



